In [50]:
import pandas as pd

In [51]:
df = pd.read_csv('Preprocessing1.csv')

In [52]:
df.isnull().sum()

Airline              0
Source               0
Destination          0
Route                1
Dep_Time             0
Arrival_Time         0
Duration             0
Total_Stops        200
Additional_Info      0
Price                0
Month                0
WeekDay              0
Day                236
dtype: int64

In [53]:
df.isnull().sum().sum()

437

In [54]:
df[['Total_Stops']]

     Total_Stops
0         1 stop
1         1 stop
2       non-stop
3         1 stop
4       non-stop
...          ...
9445      1 stop
9446      1 stop
9447      1 stop
9448      1 stop
9449     3 stops

[9450 rows x 1 columns]

In [55]:
df['Total_Stops'].unique()

array(['1 stop', 'non-stop', '2 stops', nan, '3 stops'], dtype=object)

In [56]:
df['Total_Stops'].value_counts()

Total_Stops
1 stop      4748
non-stop    3132
2 stops     1315
3 stops       55
Name: count, dtype: int64

In [57]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9450 entries, 0 to 9449
Data columns (total 13 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          9450 non-null   object
 1   Source           9450 non-null   object
 2   Destination      9450 non-null   object
 3   Route            9449 non-null   object
 4   Dep_Time         9450 non-null   object
 5   Arrival_Time     9450 non-null   object
 6   Duration         9450 non-null   object
 7   Total_Stops      9250 non-null   object
 8   Additional_Info  9450 non-null   object
 9   Price            9450 non-null   int64
 10  Month            9450 non-null   int64
 11  WeekDay          9450 non-null   object
 12  Day              9214 non-null   float64
dtypes: float64(1), int64(2), object(10)
memory usage: 959.9+ KB

In [58]:
mean = df['Price'].mean()
f"{mean:.2f}"

'9027.90'

In [59]:
df.describe()

              Price        Month          Day
count   9450.000000  9450.000000  9214.000000
mean    9027.895556     4.718730    13.517582
std     4466.677471     1.162725     8.459792
min     1759.000000     3.000000     1.000000
25%     5198.000000     3.000000     6.000000
50%     8366.000000     5.000000    12.000000
75%    12373.000000     6.000000    21.000000
max    57209.000000     6.000000    27.000000



### During which month did the highest number of flights occur? Months are represented by numerical codes, with January corresponding to 1, February to 2, and so forth.

- January

- May

- October

- December

In [60]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9450 entries, 0 to 9449
Data columns (total 13 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          9450 non-null   object
 1   Source           9450 non-null   object
 2   Destination      9450 non-null   object
 3   Route            9449 non-null   object
 4   Dep_Time         9450 non-null   object
 5   Arrival_Time     9450 non-null   object
 6   Duration         9450 non-null   object
 7   Total_Stops      9250 non-null   object
 8   Additional_Info  9450 non-null   object
 9   Price            9450 non-null   int64
 10  Month            9450 non-null   int64
 11  WeekDay          9450 non-null   object
 12  Day              9214 non-null   float64
dtypes: float64(1), int64(2), object(10)
memory usage: 959.9+ KB

In [61]:
df.head()

,Airline,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price,Month,WeekDay,Day
0,Jet Airways,Delhi,Banglore,DEL → BOM → COK,20:00,04:25 10 Jun,26h 35m,1 stop,In-flight meal not included,14924,6,Thursday,6.0
1,Jet Airways,Delhi,Cochin,DEL → BOM → COK,16:00,19:00 10 Jun,27h,1 stop,In-flight meal not included,10577,6,Sunday,9.0
2,Jet Airways,Mumbai,Hyderabad,BOM → HYD,19:35,21:05,1h 30m,non-stop,No info,5678,3,Friday,15.0
3,Multiple carriers,Delhi,Banglore,DEL → BOM → COK,18:55,01:30 16 Jun,15h 10m,1 stop,In-flight meal not included,7408,5,Monday,6.0
4,Air India,Delhi,Cochin,DEL → COK,17:10,17:55,8h 20m,non-stop,No info,6724,6,Monday,24.0

In [62]:
df['Month'].unique()

array([6, 3, 5, 4], dtype=int64)

In [63]:
df.groupby('Month')['Airline'].count().sort_values()

Month
4     926
3    2388
6    3044
5    3092
Name: Airline, dtype: int64

### Is the average price of flight tickets higher on weekends (Saturday and Sunday) or on weekdays (Remaining 5 days)?

- Weekends (Saturday and Sunday)

- Weekdays

In [64]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9450 entries, 0 to 9449
Data columns (total 13 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          9450 non-null   object
 1   Source           9450 non-null   object
 2   Destination      9450 non-null   object
 3   Route            9449 non-null   object
 4   Dep_Time         9450 non-null   object
 5   Arrival_Time     9450 non-null   object
 6   Duration         9450 non-null   object
 7   Total_Stops      9250 non-null   object
 8   Additional_Info  9450 non-null   object
 9   Price            9450 non-null   int64
 10  Month            9450 non-null   int64
 11  WeekDay          9450 non-null   object
 12  Day              9214 non-null   float64
dtypes: float64(1), int64(2), object(10)
memory usage: 959.9+ KB

In [65]:
df.head(1)

,Airline,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price,Month,WeekDay,Day
0,Jet Airways,Delhi,Banglore,DEL → BOM → COK,20:00,04:25 10 Jun,26h 35m,1 stop,In-flight meal not included,14924,6,Thursday,6.0

In [66]:
df.groupby('WeekDay')['Price'].mean().sort_values()

WeekDay
Monday       8834.710081
Saturday     8878.064683
Friday       8961.014388
Thursday     9013.744025
Wednesday    9091.326994
Tuesday      9275.404342
Sunday       9280.047087
Name: Price, dtype: float64

In [67]:
weekend2 = df.loc[ df['WeekDay'] == 'Sunday' ,'WeekDay']
weekend1 = df.loc[ df['WeekDay'] == 'Saturday' ,'WeekDay']

avg1 = df.groupby(weekend2)['Price'].mean()
avg2 = df.groupby(weekend1)['Price'].mean()
weekends = sum(avg1, avg2)
print(weekends)

WeekDay
Saturday    18158.11177
Name: Price, dtype: float64

### Question 4

Two of the entries in the 'Additional_Info' column are 'No info' and 'No Info'. Replace all occurrences of 'No Info' with 'No info'. How many flights fall under airline 'IndiGo' and have 'No info' as additional information?

In [68]:
df['Additional_Info'].unique()

array(['In-flight meal not included', 'No info',
       'No check-in baggage included', '1 Long layover',
       'Change airports', 'No Info', '2 Long layover', '1 Short layover',
       'Business class'], dtype=object)

In [69]:
df['Additional_Info'] = df['Additional_Info'].replace('No Info', 'No info')

### How many flights fall under airline 'IndiGo' and have 'No info' as additional information?

In [70]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9450 entries, 0 to 9449
Data columns (total 13 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          9450 non-null   object
 1   Source           9450 non-null   object
 2   Destination      9450 non-null   object
 3   Route            9449 non-null   object
 4   Dep_Time         9450 non-null   object
 5   Arrival_Time     9450 non-null   object
 6   Duration         9450 non-null   object
 7   Total_Stops      9250 non-null   object
 8   Additional_Info  9450 non-null   object
 9   Price            9450 non-null   int64
 10  Month            9450 non-null   int64
 11  WeekDay          9450 non-null   object
 12  Day              9214 non-null   float64
dtypes: float64(1), int64(2), object(10)
memory usage: 959.9+ KB

In [71]:
# fatch all the row of data where airline is indigo
df[(df['Airline']=='IndiGo') & ( df['Additional_Info']=='No info')].count()

Airline            1650
Source             1650
Destination        1650
Route              1650
Dep_Time           1650
Arrival_Time       1650
Duration           1650
Total_Stops        1609
Additional_Info    1650
Price              1650
Month              1650
WeekDay            1650
Day                1614
dtype: int64

In [72]:
result = (
    df.groupby(['Airline', 'Additional_Info'])
      .size()
      .reset_index(name='count')
)
print(result)

                              Airline               Additional_Info  count
0                            Air Asia   In-flight meal not included     31
1                            Air Asia  No check-in baggage included      4
2                            Air Asia                       No info    226
3                           Air India                1 Long layover      3
4                           Air India                2 Long layover      2
5                           Air India               Change airports      3
6                           Air India   In-flight meal not included    153
7                           Air India  No check-in baggage included     26
8                           Air India                       No info   1414
9                               GoAir                1 Long layover      1
10                              GoAir   In-flight meal not included     20
11                              GoAir                       No info    174
12                             IndiGo                1 Long layover      1
13                             IndiGo               1 Short layover      1
14                             IndiGo               Change airports      1
15                             IndiGo   In-flight meal not included    168
16                             IndiGo  No check-in baggage included     35
17                             IndiGo                       No info   1650
18                        Jet Airways                1 Long layover      6
19                        Jet Airways               1 Short layover      1
20                        Jet Airways                2 Long layover      1
21                        Jet Airways                Business class      1
22                        Jet Airways   In-flight meal not included   1132
23                        Jet Airways  No check-in baggage included     58
24                        Jet Airways                       No info   2119
25               Jet Airways Business                       No info      2
26                  Multiple carriers                1 Long layover      1
27                  Multiple carriers   In-flight meal not included    131
28                  Multiple carriers  No check-in baggage included     15
29                  Multiple carriers                       No info    880
30  Multiple carriers Premium economy   In-flight meal not included      1
31  Multiple carriers Premium economy                       No info     11
32                           SpiceJet                1 Long layover      1
33                           SpiceJet   In-flight meal not included     80
34                           SpiceJet  No check-in baggage included    149
35                           SpiceJet                       No info    524
36                            Vistara               Change airports      1
37                            Vistara   In-flight meal not included     34
38                            Vistara  No check-in baggage included     11
39                            Vistara                       No info    377
40            Vistara Premium economy                       No info      1

In [73]:

filtered_result = result[
    (result['Airline'] == 'IndiGo') & (result['Additional_Info'] == 'No info')
]
print(filtered_result)

   Airline Additional_Info  count
17  IndiGo         No info   1650

In [74]:
df.groupby('Airline')['Additional_Info'].count()

Airline
Air Asia                              261
Air India                            1601
GoAir                                 195
IndiGo                               1856
Jet Airways                          3318
Jet Airways Business                    2
Multiple carriers                    1027
Multiple carriers Premium economy      12
SpiceJet                              754
Vistara                               423
Vistara Premium economy                 1
Name: Additional_Info, dtype: int64

In [75]:
df['Additional_Info'].unique()

array(['In-flight meal not included', 'No info',
       'No check-in baggage included', '1 Long layover',
       'Change airports', '2 Long layover', '1 Short layover',
       'Business class'], dtype=object)

### How many flights fall under airline 'Air India' and have 'No info' as additional information?

In [76]:
df.head(1)

,Airline,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price,Month,WeekDay,Day
0,Jet Airways,Delhi,Banglore,DEL → BOM → COK,20:00,04:25 10 Jun,26h 35m,1 stop,In-flight meal not included,14924,6,Thursday,6.0

In [77]:
result = ( df.groupby(['Airline','Additional_Info']).size().reset_index(name = 'count'))

In [78]:
filter_result = result[
    (result['Airline']=='Air India')
    & (result['Additional_Info']=='No info')
    ]
print(filter_result)

     Airline Additional_Info  count
8  Air India         No info   1414

### Convert the values of 'Duration' into seconds. Enter the average duration (in seconds) of a flight. Enter your answer correct to two decimal places.

In [79]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9450 entries, 0 to 9449
Data columns (total 13 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          9450 non-null   object
 1   Source           9450 non-null   object
 2   Destination      9450 non-null   object
 3   Route            9449 non-null   object
 4   Dep_Time         9450 non-null   object
 5   Arrival_Time     9450 non-null   object
 6   Duration         9450 non-null   object
 7   Total_Stops      9250 non-null   object
 8   Additional_Info  9450 non-null   object
 9   Price            9450 non-null   int64
 10  Month            9450 non-null   int64
 11  WeekDay          9450 non-null   object
 12  Day              9214 non-null   float64
dtypes: float64(1), int64(2), object(10)
memory usage: 959.9+ KB

In [80]:
df["Price"].value_counts()

Price
10262    233
10844    193
7229     160
4804     148
4823     137
        ...
4860       1
12074      1
11306      1
5626       1
10278      1
Name: count, Length: 1499, dtype: int64

In [81]:
def convert(time):
    h = 0
    m= 0 
    rest = time
    if 'h' in time:
        h_part , rest = time.split('h', 1)
        h = int(h_part) if h_part else 0 
    if 'm' in rest:
        m_part  = rest.split('m',1)[0]
        m = int(m_part) if m_part else 0
    return float(h*3600 + m*60)
convert('26h 35m')
df['duration_sec'] = df['Duration'].apply(convert)

In [82]:
f"{df['duration_sec'].mean():.2f}"

'38957.94'

In [83]:
round(df['duration_sec'].mean(),2)

38957.94

In [84]:
df.isna

<bound method DataFrame.isna of                 Airline    Source Destination                        Route  \
0           Jet Airways     Delhi    Banglore              DEL → BOM → COK
1           Jet Airways     Delhi      Cochin              DEL → BOM → COK
2           Jet Airways    Mumbai   Hyderabad                    BOM → HYD
3     Multiple carriers     Delhi    Banglore              DEL → BOM → COK
4             Air India     Delhi      Cochin                    DEL → COK
...                 ...       ...         ...                          ...
9445          Air India  Banglore      Cochin              BLR → MAA → DEL
9446             IndiGo     Delhi      Cochin              DEL → BOM → COK
9447  Multiple carriers     Delhi      Cochin              DEL → BOM → COK
9448        Jet Airways   Kolkata    Banglore              CCU → BOM → BLR
9449          Air India   Kolkata    Banglore  CCU → GAU → IMF → DEL → BLR

     Dep_Time  Arrival_Time Duration Total_Stops              Additional_Info  \
0       20:00  04:25 10 Jun  26h 35m      1 stop  In-flight meal not included
1       16:00  19:00 10 Jun      27h      1 stop  In-flight meal not included
2       19:35         21:05   1h 30m    non-stop                      No info
3       18:55  01:30 16 Jun  15h 10m      1 stop  In-flight meal not included
4       17:10         17:55   8h 20m    non-stop                      No info
...       ...           ...      ...         ...                          ...
9445    19:30         19:50   8h 55m      1 stop  In-flight meal not included
9446    17:00         21:00   8h 35m      1 stop                      No info
9447    07:05         19:45  15h 15m      1 stop                      No info
9448    08:20         19:50   12h 5m      1 stop                      No info
9449    14:30         23:15   8h 45m     3 stops                      No info

      Price  Month    WeekDay   Day  duration_sec
0     14924      6   Thursday   6.0       95700.0
1     10577      6     Sunday   9.0       97200.0
2      5678      3     Friday  15.0        5400.0
3      7408      5     Monday   6.0       54600.0
4      6724      6     Monday  24.0       30000.0
...     ...    ...        ...   ...           ...
9445   5932      6  Wednesday  12.0       32100.0
9446   6838      3     Sunday   3.0       30900.0
9447  12615      3   Saturday   9.0       54900.0
9448  10844      5   Saturday  18.0       43500.0
9449  15145      5   Thursday   9.0       31500.0

[9450 rows x 14 columns]>

### Apply the following functions to the columns Dep_Time and Arrival_Time:

Transform the values in the 'dep_time' and 'arrival_time' columns to represent the hour component. For instance, if an entry is 10:05 June 13 or 10:05, the corresponding value should be 10. 
Then convert the time into four categories as follows:
5 <= hour < 12 = Morning 
12 <= hour < 17 = Afternoon 
17 <= hour < 20 = Evening 
20 <= hour < 5 = Night

Note: Please ensure that you make the changes directly within the dataset and continue to use that modified dataset for subsequent questions.

In [85]:
def hour(time):
    h_split , rest = time.split(':',1)
    h = int(h_split) if h_split else 0
    return h
hour('04:25 10 Jun')
def name(h):
    if h >= 5 and h<12:
        return 'Morning'
    elif h >= 12 and h <17:
        return 'Afternoon'
    elif h >=17 and h<20:
        return 'Evening'
    else:
        return 'Night'

In [86]:
df['Dep_Time']

0       20:00
1       16:00
2       19:35
3       18:55
4       17:10
        ...
9445    19:30
9446    17:00
9447    07:05
9448    08:20
9449    14:30
Name: Dep_Time, Length: 9450, dtype: object

In [87]:
df['Dep_hour']=df['Dep_Time'].apply(hour).apply(name)
df['Arr_hour']=df['Arrival_Time'].apply(hour).apply(name)

In [88]:
df.head(5)

,Airline,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price,Month,WeekDay,Day,duration_sec,Dep_hour,Arr_hour
0,Jet Airways,Delhi,Banglore,DEL → BOM → COK,20:00,04:25 10 Jun,26h 35m,1 stop,In-flight meal not included,14924,6,Thursday,6.0,95700.0,Night,Night
1,Jet Airways,Delhi,Cochin,DEL → BOM → COK,16:00,19:00 10 Jun,27h,1 stop,In-flight meal not included,10577,6,Sunday,9.0,97200.0,Afternoon,Evening
2,Jet Airways,Mumbai,Hyderabad,BOM → HYD,19:35,21:05,1h 30m,non-stop,No info,5678,3,Friday,15.0,5400.0,Evening,Night
3,Multiple carriers,Delhi,Banglore,DEL → BOM → COK,18:55,01:30 16 Jun,15h 10m,1 stop,In-flight meal not included,7408,5,Monday,6.0,54600.0,Evening,Night
4,Air India,Delhi,Cochin,DEL → COK,17:10,17:55,8h 20m,non-stop,No info,6724,6,Monday,24.0,30000.0,Evening,Evening

#### How many flights started in the Morning and arrived the destination at Evening?

In [89]:
((df['Dep_hour']=='Morning') & (df['Arr_hour']=='Evening')).sum()

922

#### Encode the values of column 'WeekDay' as follows:
Weekends (Sunday, Saturday) = 1
all remaining five days = 0
What is the most frequent (mode) WeekDay?

- Weekends

- Weekdays

In [90]:
def weekends1_weekday0(day):
    if day =='Sunday' or day == 'Saturday':
        return 1
    else:
        return 0

In [91]:
df['week']=df['WeekDay'].apply(weekends1_weekday0)
df['week'].mode() # most frequent is weekdays

0    0
Name: week, dtype: int64